Revit 2027 API
BuiltInFailures.RebarCouplerFailures.NoTypeParamsDefinedWarning Property
 The parameters of the default type have no values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoTypeParamsDefinedWarning { get; }
Public Shared ReadOnly Property NoTypeParamsDefinedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoTypeParamsDefinedWarning {
	FailureDefinitionId^ get ();
}
static member NoTypeParamsDefinedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace